//#include <stdio.h>

/*
함수 선언부분, 반환형이 int라서 return 0;을 통해 반환한다. 
함수명은 main이고, ()에 입력을 넣지만, main은 입력을 받지 않아 ()로 표현된다. 
*/

//int main()
//{
	/*
	함수 정의부분, 입력값을 받아서 요구조건을 구현한다.
	return 구문을 통해 그 결과값을 반환한다.
	만약 출력(반환값)이 없는경우 return 구문은 사용하지 않는다. 
	
	함수 호출은 함수명()이 형태로 호출된다.
	이 때 괄호 안에 입력이 들어가며 함수를 호출한다.
	함수를 호출하면 함수 정의부분에 구현된 소스코드가 실행된다. 
	
	예를 들어, main함수는 main();으로 호출된다. 
	main 함수는 코드 실행시 자동으로 호출된다. 
	*/
//	int i = 0;
//	char j;
//	
//	while(j != 's') {
//		printf("몇 단을 출력할까요 ? , 종료하려면 's'를 누르세요. ");
//		scanf(" %c", &j);
//
//		// 숫자로 형변환 (char to int)
//		int dan = j - 48;
//		switch(j)
//		{
//			default:
//				printf("유효하지 않은 문자입니다.");	
//				break;
//			case '0':
//			case '1':
//			case '2':
//			case '3':
//			case '4':
//			case '5':
//			case '6':
//			case '7':
//			case '8':
//			case '9':
//				for (i = 1; i < 10; i++) {
//				printf("%d x %d = %d \n", dan, i, dan * i);	
//				}
//				printf("---- %d단 끝 ! ---- \n", dan);
//				break;
//			case 's':	
//				printf("종료합니다.");	
//				break;
//		}
//	}
//
//	return 0;
//}

// 함수 선언 : 함수명, 반환값, 입력을 정의하여 함수를 정의합니다.
// 함수 정의 : 함수선언 단계에서 받은 입력값과 그 함수의 동작을 정의합니다.
// 함수 호출 : 함수명과 입력값을 입력하여 해당 함수를 호출합니다. 
