//#include <stdio.h>
//
///*
//	func 함수는 int형으로 출력하며 함수 선언부는 다음과 같이 이뤄진다. 
//	int[출력 자료형] func[함수명] ([입력부분])
//	출력 자료형에 int, char 등 출력하는 자료형을 적는다. 
//	배열 반환하는 방법은 아직 잘 모르겠다.
//	
//	함수 정의부분엔 입력부에서 전달받은 변수를 활용해 필요사항 및 요구사항
//	을 구현한다. 출력이 있는 경우 return 구문을 통해 반환한다. 
//	
//	함수 호출은 함수 선언부에 정의된 입력에 유의하여 함수명() 형태로 호출한다. 
//*/
//int func(int a, int b)
//{
//	int ret;
//	ret = a + b;
//	
//	return ret;
//}
//
//int main()
//{
//	int ret = func(10, 20);
//	
//	printf("전달된 값은 %d 입니다. \n", ret);
//	
//	return 0;
//}
