//#include <stdio.h>
//
//int main()
//{
//	int a = 10;						// 00000000 ... 00001010
//	int b = 12;						// 00000000 ... 00001100
//	
//	printf("a & b : %d\n", a & b);		// &는 앰퍼샌드, 주소연산자로도 쓰임. 논리곱 
//	printf("a ^ b : %d\n", a ^ b);		// ^는 햇(hat)이라고 부름. 배타적 논리합 (다르면 1)
//	printf("a | b : %d\n", a | b);		// |는 파이프, 버티컬 바로 부름. 논리합 
//	printf("~a : %d\n", ~a);			// ~ 틸드(Tilde) 부정연산자, 비트반전 
//	printf("a << 1 : %d\n", a << 1);		// 00000000 ... 0001 0100 -> 20
//	printf("a >> 2 : %d\n", a >> 2);		// 00000000 ... 0000 0010 -> 2
//	
//	return 0;
//}
